amd-ucode
base
base-devel
bash-completion
discord
dmenu
docker
docker-buildx
docker-compose
dolphin
dunst
efibootmgr
evince
fd
firefox
git
gnome-themes-extra
grim
grub
gst-plugin-pipewire
htop
hyprland
imagemagick
iwd
keepassxc
kitty
libpulse
libva-mesa-driver
linux
linux-firmware
lua51
luarocks
nano
nautilus
neofetch
neovim
network-manager-applet
networkmanager
noto-fonts
noto-fonts-emoji
noto-fonts-extra
npm
ntfs-3g
nwg-look
pacutils
pavucontrol
pipewire
pipewire-alsa
pipewire-jack
pipewire-pulse
polkit-gnome
polkit-kde-agent
pyenv
python-pip
python-pipenv
qt5-wayland
qt5ct
qt6-wayland
qt6ct
ripgrep
rust
sddm
slurp
smartmontools
stylua
swaybg
terminator
ttf-dejavu
ttf-meslo-nerd
ttf-nerd-fonts-symbols
ttf-noto-nerd
viewnior
vim
vulkan-radeon
waybar
wget
wireless_tools
wireplumber
wl-clipboard
wofi
xdg-desktop-portal-hyprland
xdg-utils
xf86-video-amdgpu
xf86-video-ati
xorg-server
xorg-xinit
zram-generator
zsh
zsh-completions
